espressif/esp-idf/components/soc/esp32c61/register/soc/soc_etm_reg.h
/** SOC_ETM_EVT_ST2_REG register
 *  Events trigger status register
 */
#define SOC_ETM_EVT_ST2_REG (DR_REG_SOC_ETM_BASE + 0x1b8)
/** SOC_ETM_REGDMA_EVT_DONE1_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents REGDMA_evt_done1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_REGDMA_EVT_DONE1_ST    (BIT(0))
#define SOC_ETM_REGDMA_EVT_DONE1_ST_M  (SOC_ETM_REGDMA_EVT_DONE1_ST_V << SOC_ETM_REGDMA_EVT_DONE1_ST_S)
#define SOC_ETM_REGDMA_EVT_DONE1_ST_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_DONE1_ST_S  0
/** SOC_ETM_REGDMA_EVT_DONE2_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents REGDMA_evt_done2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_REGDMA_EVT_DONE2_ST    (BIT(1))
#define SOC_ETM_REGDMA_EVT_DONE2_ST_M  (SOC_ETM_REGDMA_EVT_DONE2_ST_V << SOC_ETM_REGDMA_EVT_DONE2_ST_S)
#define SOC_ETM_REGDMA_EVT_DONE2_ST_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_DONE2_ST_S  1
/** SOC_ETM_REGDMA_EVT_DONE3_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents REGDMA_evt_done3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_REGDMA_EVT_DONE3_ST    (BIT(2))
#define SOC_ETM_REGDMA_EVT_DONE3_ST_M  (SOC_ETM_REGDMA_EVT_DONE3_ST_V << SOC_ETM_REGDMA_EVT_DONE3_ST_S)
#define SOC_ETM_REGDMA_EVT_DONE3_ST_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_DONE3_ST_S  2
/** SOC_ETM_REGDMA_EVT_ERR0_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents REGDMA_evt_err0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_REGDMA_EVT_ERR0_ST    (BIT(3))
#define SOC_ETM_REGDMA_EVT_ERR0_ST_M  (SOC_ETM_REGDMA_EVT_ERR0_ST_V << SOC_ETM_REGDMA_EVT_ERR0_ST_S)
#define SOC_ETM_REGDMA_EVT_ERR0_ST_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_ERR0_ST_S  3
/** SOC_ETM_REGDMA_EVT_ERR1_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents REGDMA_evt_err1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_REGDMA_EVT_ERR1_ST    (BIT(4))
#define SOC_ETM_REGDMA_EVT_ERR1_ST_M  (SOC_ETM_REGDMA_EVT_ERR1_ST_V << SOC_ETM_REGDMA_EVT_ERR1_ST_S)
#define SOC_ETM_REGDMA_EVT_ERR1_ST_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_ERR1_ST_S  4
/** SOC_ETM_REGDMA_EVT_ERR2_ST : R/WTC/SS; bitpos: [5]; default: 0;
 *  Represents REGDMA_evt_err2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_REGDMA_EVT_ERR2_ST    (BIT(5))
#define SOC_ETM_REGDMA_EVT_ERR2_ST_M  (SOC_ETM_REGDMA_EVT_ERR2_ST_V << SOC_ETM_REGDMA_EVT_ERR2_ST_S)
#define SOC_ETM_REGDMA_EVT_ERR2_ST_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_ERR2_ST_S  5
/** SOC_ETM_REGDMA_EVT_ERR3_ST : R/WTC/SS; bitpos: [6]; default: 0;
 *  Represents REGDMA_evt_err3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_REGDMA_EVT_ERR3_ST    (BIT(6))
#define SOC_ETM_REGDMA_EVT_ERR3_ST_M  (SOC_ETM_REGDMA_EVT_ERR3_ST_V << SOC_ETM_REGDMA_EVT_ERR3_ST_S)
#define SOC_ETM_REGDMA_EVT_ERR3_ST_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_ERR3_ST_S  6
/** SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST : R/WTC/SS; bitpos: [7]; default: 0;
 *  Represents TMPSNSR_evt_over_limit trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST    (BIT(7))
#define SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_M  (SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_V << SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_S)
#define SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_V  0x00000001U
#define SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_S  7
/** SOC_ETM_I2S0_EVT_RX_DONE_ST : R/WTC/SS; bitpos: [8]; default: 0;
 *  Represents I2S0_evt_rx_done trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S0_EVT_RX_DONE_ST    (BIT(8))
#define SOC_ETM_I2S0_EVT_RX_DONE_ST_M  (SOC_ETM_I2S0_EVT_RX_DONE_ST_V << SOC_ETM_I2S0_EVT_RX_DONE_ST_S)
#define SOC_ETM_I2S0_EVT_RX_DONE_ST_V  0x00000001U
#define SOC_ETM_I2S0_EVT_RX_DONE_ST_S  8
/** SOC_ETM_I2S0_EVT_TX_DONE_ST : R/WTC/SS; bitpos: [9]; default: 0;
 *  Represents I2S0_evt_tx_done trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S0_EVT_TX_DONE_ST    (BIT(9))
#define SOC_ETM_I2S0_EVT_TX_DONE_ST_M  (SOC_ETM_I2S0_EVT_TX_DONE_ST_V << SOC_ETM_I2S0_EVT_TX_DONE_ST_S)
#define SOC_ETM_I2S0_EVT_TX_DONE_ST_V  0x00000001U
#define SOC_ETM_I2S0_EVT_TX_DONE_ST_S  9
/** SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST : R/WTC/SS; bitpos: [10]; default: 0;
 *  Represents I2S0_evt_x_words_received trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST    (BIT(10))
#define SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_M  (SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_V << SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_S)
#define SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_V  0x00000001U
#define SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_S  10
/** SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST : R/WTC/SS; bitpos: [11]; default: 0;
 *  Represents I2S0_evt_x_words_sent trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST    (BIT(11))
#define SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_M  (SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_V << SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_S)
#define SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_V  0x00000001U
#define SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_S  11
/** SOC_ETM_I2S1_EVT_RX_DONE_ST : R/WTC/SS; bitpos: [12]; default: 0;
 *  Represents I2S1_evt_rx_done trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S1_EVT_RX_DONE_ST    (BIT(12))
#define SOC_ETM_I2S1_EVT_RX_DONE_ST_M  (SOC_ETM_I2S1_EVT_RX_DONE_ST_V << SOC_ETM_I2S1_EVT_RX_DONE_ST_S)
#define SOC_ETM_I2S1_EVT_RX_DONE_ST_V  0x00000001U
#define SOC_ETM_I2S1_EVT_RX_DONE_ST_S  12
/** SOC_ETM_I2S1_EVT_TX_DONE_ST : R/WTC/SS; bitpos: [13]; default: 0;
 *  Represents I2S1_evt_tx_done trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S1_EVT_TX_DONE_ST    (BIT(13))
#define SOC_ETM_I2S1_EVT_TX_DONE_ST_M  (SOC_ETM_I2S1_EVT_TX_DONE_ST_V << SOC_ETM_I2S1_EVT_TX_DONE_ST_S)
#define SOC_ETM_I2S1_EVT_TX_DONE_ST_V  0x00000001U
#define SOC_ETM_I2S1_EVT_TX_DONE_ST_S  13
/** SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST : R/WTC/SS; bitpos: [14]; default: 0;
 *  Represents I2S1_evt_x_words_received trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST    (BIT(14))
#define SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_M  (SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_V << SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_S)
#define SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_V  0x00000001U
#define SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_S  14
/** SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST : R/WTC/SS; bitpos: [15]; default: 0;
 *  Represents I2S1_evt_x_words_sent trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST    (BIT(15))
#define SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_M  (SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_V << SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_S)
#define SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_V  0x00000001U
#define SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_S  15
/** SOC_ETM_ULP_EVT_ERR_INTR_ST : R/WTC/SS; bitpos: [16]; default: 0;
 *  Represents ULP_evt_err_intr trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ULP_EVT_ERR_INTR_ST    (BIT(16))
#define SOC_ETM_ULP_EVT_ERR_INTR_ST_M  (SOC_ETM_ULP_EVT_ERR_INTR_ST_V << SOC_ETM_ULP_EVT_ERR_INTR_ST_S)
#define SOC_ETM_ULP_EVT_ERR_INTR_ST_V  0x00000001U
#define SOC_ETM_ULP_EVT_ERR_INTR_ST_S  16
/** SOC_ETM_ULP_EVT_HALT_ST : R/WTC/SS; bitpos: [17]; default: 0;
 *  Represents ULP_evt_halt trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ULP_EVT_HALT_ST    (BIT(17))
#define SOC_ETM_ULP_EVT_HALT_ST_M  (SOC_ETM_ULP_EVT_HALT_ST_V << SOC_ETM_ULP_EVT_HALT_ST_S)
#define SOC_ETM_ULP_EVT_HALT_ST_V  0x00000001U
#define SOC_ETM_ULP_EVT_HALT_ST_S  17
/** SOC_ETM_ULP_EVT_START_INTR_ST : R/WTC/SS; bitpos: [18]; default: 0;
 *  Represents ULP_evt_start_intr trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ULP_EVT_START_INTR_ST    (BIT(18))
#define SOC_ETM_ULP_EVT_START_INTR_ST_M  (SOC_ETM_ULP_EVT_START_INTR_ST_V << SOC_ETM_ULP_EVT_START_INTR_ST_S)
#define SOC_ETM_ULP_EVT_START_INTR_ST_V  0x00000001U
#define SOC_ETM_ULP_EVT_START_INTR_ST_S  18
/** SOC_ETM_RTC_EVT_TICK_ST : R/WTC/SS; bitpos: [19]; default: 0;
 *  Represents RTC_evt_tick trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_RTC_EVT_TICK_ST    (BIT(19))
#define SOC_ETM_RTC_EVT_TICK_ST_M  (SOC_ETM_RTC_EVT_TICK_ST_V << SOC_ETM_RTC_EVT_TICK_ST_S)
#define SOC_ETM_RTC_EVT_TICK_ST_V  0x00000001U
#define SOC_ETM_RTC_EVT_TICK_ST_S  19
/** SOC_ETM_RTC_EVT_OVF_ST : R/WTC/SS; bitpos: [20]; default: 0;
 *  Represents RTC_evt_ovf trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_RTC_EVT_OVF_ST    (BIT(20))
#define SOC_ETM_RTC_EVT_OVF_ST_M  (SOC_ETM_RTC_EVT_OVF_ST_V << SOC_ETM_RTC_EVT_OVF_ST_S)
#define SOC_ETM_RTC_EVT_OVF_ST_V  0x00000001U
#define SOC_ETM_RTC_EVT_OVF_ST_S  20
/** SOC_ETM_RTC_EVT_CMP_ST : R/WTC/SS; bitpos: [21]; default: 0;
 *  Represents RTC_evt_cmp trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_RTC_EVT_CMP_ST    (BIT(21))
#define SOC_ETM_RTC_EVT_CMP_ST_M  (SOC_ETM_RTC_EVT_CMP_ST_V << SOC_ETM_RTC_EVT_CMP_ST_S)
#define SOC_ETM_RTC_EVT_CMP_ST_V  0x00000001U
#define SOC_ETM_RTC_EVT_CMP_ST_S  21
/** SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH0_ST : R/WTC/SS; bitpos: [22]; default: 0;
 *  Represents GDMA_AHB_evt_in_done_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH0_ST    (BIT(22))
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH0_ST_M  (SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH0_ST_V << SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH0_ST_S)
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH0_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH0_ST_S  22
/** SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH1_ST : R/WTC/SS; bitpos: [23]; default: 0;
 *  Represents GDMA_AHB_evt_in_done_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH1_ST    (BIT(23))
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH1_ST_M  (SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH1_ST_V << SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH1_ST_S)
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH1_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH1_ST_S  23
/** SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH2_ST : R/WTC/SS; bitpos: [24]; default: 0;
 *  Represents GDMA_AHB_evt_in_done_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH2_ST    (BIT(24))
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH2_ST_M  (SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH2_ST_V << SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH2_ST_S)
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH2_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_EVT_IN_DONE_CH2_ST_S  24
/** SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH0_ST : R/WTC/SS; bitpos: [25]; default: 0;
 *  Represents GDMA_AHB_evt_in_suc_eof_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH0_ST    (BIT(25))
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_M  (SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_V << SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_S)
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_S  25
/** SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH1_ST : R/WTC/SS; bitpos: [26]; default: 0;
 *  Represents GDMA_AHB_evt_in_suc_eof_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH1_ST    (BIT(26))
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_M  (SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_V << SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_S)
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_S  26
/** SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH2_ST : R/WTC/SS; bitpos: [27]; default: 0;
 *  Represents GDMA_AHB_evt_in_suc_eof_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH2_ST    (BIT(27))
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_M  (SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_V << SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_S)
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_S  27
/** SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH0_ST : R/WTC/SS; bitpos: [28]; default: 0;
 *  Represents GDMA_AHB_evt_in_fifo_empty_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH0_ST    (BIT(28))
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH0_ST_M  (SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH0_ST_V << SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH0_ST_S)
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH0_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH0_ST_S  28
/** SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH1_ST : R/WTC/SS; bitpos: [29]; default: 0;
 *  Represents GDMA_AHB_evt_in_fifo_empty_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH1_ST    (BIT(29))
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH1_ST_M  (SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH1_ST_V << SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH1_ST_S)
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH1_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH1_ST_S  29
/** SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH2_ST : R/WTC/SS; bitpos: [30]; default: 0;
 *  Represents GDMA_AHB_evt_in_fifo_empty_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH2_ST    (BIT(30))
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH2_ST_M  (SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH2_ST_V << SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH2_ST_S)
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH2_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_EMPTY_CH2_ST_S  30
/** SOC_ETM_GDMA_AHB_EVT_IN_FIFO_FULL_CH0_ST : R/WTC/SS; bitpos: [31]; default: 0;
 *  Represents GDMA_AHB_evt_in_fifo_full_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_FULL_CH0_ST    (BIT(31))
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_FULL_CH0_ST_M  (SOC_ETM_GDMA_AHB_EVT_IN_FIFO_FULL_CH0_ST_V << SOC_ETM_GDMA_AHB_EVT_IN_FIFO_FULL_CH0_ST_S)
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_FULL_CH0_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_EVT_IN_FIFO_FULL_CH0_ST_S  31

