espressif/esp-idf/components/soc/esp32c61/register/soc/soc_etm_reg.h
/** SOC_ETM_TASK_ST3_REG register
 *  Tasks trigger status register
 */
#define SOC_ETM_TASK_ST3_REG (DR_REG_SOC_ETM_BASE + 0x1e0)
/** SOC_ETM_TG1_TASK_ALARM_START_TIMER1_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents TG1_task_alarm_start_timer1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG1_TASK_ALARM_START_TIMER1_ST    (BIT(0))
#define SOC_ETM_TG1_TASK_ALARM_START_TIMER1_ST_M  (SOC_ETM_TG1_TASK_ALARM_START_TIMER1_ST_V << SOC_ETM_TG1_TASK_ALARM_START_TIMER1_ST_S)
#define SOC_ETM_TG1_TASK_ALARM_START_TIMER1_ST_V  0x00000001U
#define SOC_ETM_TG1_TASK_ALARM_START_TIMER1_ST_S  0
/** SOC_ETM_TG1_TASK_CNT_STOP_TIMER1_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents TG1_task_cnt_stop_timer1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG1_TASK_CNT_STOP_TIMER1_ST    (BIT(1))
#define SOC_ETM_TG1_TASK_CNT_STOP_TIMER1_ST_M  (SOC_ETM_TG1_TASK_CNT_STOP_TIMER1_ST_V << SOC_ETM_TG1_TASK_CNT_STOP_TIMER1_ST_S)
#define SOC_ETM_TG1_TASK_CNT_STOP_TIMER1_ST_V  0x00000001U
#define SOC_ETM_TG1_TASK_CNT_STOP_TIMER1_ST_S  1
/** SOC_ETM_TG1_TASK_CNT_RELOAD_TIMER1_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents TG1_task_cnt_reload_timer1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG1_TASK_CNT_RELOAD_TIMER1_ST    (BIT(2))
#define SOC_ETM_TG1_TASK_CNT_RELOAD_TIMER1_ST_M  (SOC_ETM_TG1_TASK_CNT_RELOAD_TIMER1_ST_V << SOC_ETM_TG1_TASK_CNT_RELOAD_TIMER1_ST_S)
#define SOC_ETM_TG1_TASK_CNT_RELOAD_TIMER1_ST_V  0x00000001U
#define SOC_ETM_TG1_TASK_CNT_RELOAD_TIMER1_ST_S  2
/** SOC_ETM_TG1_TASK_CNT_CAP_TIMER1_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents TG1_task_cnt_cap_timer1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG1_TASK_CNT_CAP_TIMER1_ST    (BIT(3))
#define SOC_ETM_TG1_TASK_CNT_CAP_TIMER1_ST_M  (SOC_ETM_TG1_TASK_CNT_CAP_TIMER1_ST_V << SOC_ETM_TG1_TASK_CNT_CAP_TIMER1_ST_S)
#define SOC_ETM_TG1_TASK_CNT_CAP_TIMER1_ST_V  0x00000001U
#define SOC_ETM_TG1_TASK_CNT_CAP_TIMER1_ST_S  3
/** SOC_ETM_ADC_TASK_SAMPLE0_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents ADC_task_sample0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ADC_TASK_SAMPLE0_ST    (BIT(4))
#define SOC_ETM_ADC_TASK_SAMPLE0_ST_M  (SOC_ETM_ADC_TASK_SAMPLE0_ST_V << SOC_ETM_ADC_TASK_SAMPLE0_ST_S)
#define SOC_ETM_ADC_TASK_SAMPLE0_ST_V  0x00000001U
#define SOC_ETM_ADC_TASK_SAMPLE0_ST_S  4
/** SOC_ETM_ADC_TASK_SAMPLE1_ST : R/WTC/SS; bitpos: [5]; default: 0;
 *  Represents ADC_task_sample1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ADC_TASK_SAMPLE1_ST    (BIT(5))
#define SOC_ETM_ADC_TASK_SAMPLE1_ST_M  (SOC_ETM_ADC_TASK_SAMPLE1_ST_V << SOC_ETM_ADC_TASK_SAMPLE1_ST_S)
#define SOC_ETM_ADC_TASK_SAMPLE1_ST_V  0x00000001U
#define SOC_ETM_ADC_TASK_SAMPLE1_ST_S  5
/** SOC_ETM_ADC_TASK_START0_ST : R/WTC/SS; bitpos: [6]; default: 0;
 *  Represents ADC_task_start0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ADC_TASK_START0_ST    (BIT(6))
#define SOC_ETM_ADC_TASK_START0_ST_M  (SOC_ETM_ADC_TASK_START0_ST_V << SOC_ETM_ADC_TASK_START0_ST_S)
#define SOC_ETM_ADC_TASK_START0_ST_V  0x00000001U
#define SOC_ETM_ADC_TASK_START0_ST_S  6
/** SOC_ETM_ADC_TASK_STOP0_ST : R/WTC/SS; bitpos: [7]; default: 0;
 *  Represents ADC_task_stop0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ADC_TASK_STOP0_ST    (BIT(7))
#define SOC_ETM_ADC_TASK_STOP0_ST_M  (SOC_ETM_ADC_TASK_STOP0_ST_V << SOC_ETM_ADC_TASK_STOP0_ST_S)
#define SOC_ETM_ADC_TASK_STOP0_ST_V  0x00000001U
#define SOC_ETM_ADC_TASK_STOP0_ST_S  7
/** SOC_ETM_REGDMA_TASK_START0_ST : R/WTC/SS; bitpos: [8]; default: 0;
 *  Represents REGDMA_task_start0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_REGDMA_TASK_START0_ST    (BIT(8))
#define SOC_ETM_REGDMA_TASK_START0_ST_M  (SOC_ETM_REGDMA_TASK_START0_ST_V << SOC_ETM_REGDMA_TASK_START0_ST_S)
#define SOC_ETM_REGDMA_TASK_START0_ST_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START0_ST_S  8
/** SOC_ETM_REGDMA_TASK_START1_ST : R/WTC/SS; bitpos: [9]; default: 0;
 *  Represents REGDMA_task_start1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_REGDMA_TASK_START1_ST    (BIT(9))
#define SOC_ETM_REGDMA_TASK_START1_ST_M  (SOC_ETM_REGDMA_TASK_START1_ST_V << SOC_ETM_REGDMA_TASK_START1_ST_S)
#define SOC_ETM_REGDMA_TASK_START1_ST_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START1_ST_S  9
/** SOC_ETM_REGDMA_TASK_START2_ST : R/WTC/SS; bitpos: [10]; default: 0;
 *  Represents REGDMA_task_start2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_REGDMA_TASK_START2_ST    (BIT(10))
#define SOC_ETM_REGDMA_TASK_START2_ST_M  (SOC_ETM_REGDMA_TASK_START2_ST_V << SOC_ETM_REGDMA_TASK_START2_ST_S)
#define SOC_ETM_REGDMA_TASK_START2_ST_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START2_ST_S  10
/** SOC_ETM_REGDMA_TASK_START3_ST : R/WTC/SS; bitpos: [11]; default: 0;
 *  Represents REGDMA_task_start3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_REGDMA_TASK_START3_ST    (BIT(11))
#define SOC_ETM_REGDMA_TASK_START3_ST_M  (SOC_ETM_REGDMA_TASK_START3_ST_V << SOC_ETM_REGDMA_TASK_START3_ST_S)
#define SOC_ETM_REGDMA_TASK_START3_ST_V  0x00000001U
#define SOC_ETM_REGDMA_TASK_START3_ST_S  11
/** SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST : R/WTC/SS; bitpos: [12]; default: 0;
 *  Represents TMPSNSR_task_start_sample trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST    (BIT(12))
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_M  (SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_V << SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_S)
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_V  0x00000001U
#define SOC_ETM_TMPSNSR_TASK_START_SAMPLE_ST_S  12
/** SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST : R/WTC/SS; bitpos: [13]; default: 0;
 *  Represents TMPSNSR_task_stop_sample trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST    (BIT(13))
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_M  (SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_V << SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_S)
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_V  0x00000001U
#define SOC_ETM_TMPSNSR_TASK_STOP_SAMPLE_ST_S  13
/** SOC_ETM_I2S0_TASK_START_RX_ST : R/WTC/SS; bitpos: [14]; default: 0;
 *  Represents I2S0_task_start_rx trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S0_TASK_START_RX_ST    (BIT(14))
#define SOC_ETM_I2S0_TASK_START_RX_ST_M  (SOC_ETM_I2S0_TASK_START_RX_ST_V << SOC_ETM_I2S0_TASK_START_RX_ST_S)
#define SOC_ETM_I2S0_TASK_START_RX_ST_V  0x00000001U
#define SOC_ETM_I2S0_TASK_START_RX_ST_S  14
/** SOC_ETM_I2S0_TASK_START_TX_ST : R/WTC/SS; bitpos: [15]; default: 0;
 *  Represents I2S0_task_start_tx trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S0_TASK_START_TX_ST    (BIT(15))
#define SOC_ETM_I2S0_TASK_START_TX_ST_M  (SOC_ETM_I2S0_TASK_START_TX_ST_V << SOC_ETM_I2S0_TASK_START_TX_ST_S)
#define SOC_ETM_I2S0_TASK_START_TX_ST_V  0x00000001U
#define SOC_ETM_I2S0_TASK_START_TX_ST_S  15
/** SOC_ETM_I2S0_TASK_STOP_RX_ST : R/WTC/SS; bitpos: [16]; default: 0;
 *  Represents I2S0_task_stop_rx trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S0_TASK_STOP_RX_ST    (BIT(16))
#define SOC_ETM_I2S0_TASK_STOP_RX_ST_M  (SOC_ETM_I2S0_TASK_STOP_RX_ST_V << SOC_ETM_I2S0_TASK_STOP_RX_ST_S)
#define SOC_ETM_I2S0_TASK_STOP_RX_ST_V  0x00000001U
#define SOC_ETM_I2S0_TASK_STOP_RX_ST_S  16
/** SOC_ETM_I2S0_TASK_STOP_TX_ST : R/WTC/SS; bitpos: [17]; default: 0;
 *  Represents I2S0_task_stop_tx trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S0_TASK_STOP_TX_ST    (BIT(17))
#define SOC_ETM_I2S0_TASK_STOP_TX_ST_M  (SOC_ETM_I2S0_TASK_STOP_TX_ST_V << SOC_ETM_I2S0_TASK_STOP_TX_ST_S)
#define SOC_ETM_I2S0_TASK_STOP_TX_ST_V  0x00000001U
#define SOC_ETM_I2S0_TASK_STOP_TX_ST_S  17
/** SOC_ETM_I2S1_TASK_START_RX_ST : R/WTC/SS; bitpos: [18]; default: 0;
 *  Represents I2S1_task_start_rx trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S1_TASK_START_RX_ST    (BIT(18))
#define SOC_ETM_I2S1_TASK_START_RX_ST_M  (SOC_ETM_I2S1_TASK_START_RX_ST_V << SOC_ETM_I2S1_TASK_START_RX_ST_S)
#define SOC_ETM_I2S1_TASK_START_RX_ST_V  0x00000001U
#define SOC_ETM_I2S1_TASK_START_RX_ST_S  18
/** SOC_ETM_I2S1_TASK_START_TX_ST : R/WTC/SS; bitpos: [19]; default: 0;
 *  Represents I2S1_task_start_tx trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S1_TASK_START_TX_ST    (BIT(19))
#define SOC_ETM_I2S1_TASK_START_TX_ST_M  (SOC_ETM_I2S1_TASK_START_TX_ST_V << SOC_ETM_I2S1_TASK_START_TX_ST_S)
#define SOC_ETM_I2S1_TASK_START_TX_ST_V  0x00000001U
#define SOC_ETM_I2S1_TASK_START_TX_ST_S  19
/** SOC_ETM_I2S1_TASK_STOP_RX_ST : R/WTC/SS; bitpos: [20]; default: 0;
 *  Represents I2S1_task_stop_rx trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S1_TASK_STOP_RX_ST    (BIT(20))
#define SOC_ETM_I2S1_TASK_STOP_RX_ST_M  (SOC_ETM_I2S1_TASK_STOP_RX_ST_V << SOC_ETM_I2S1_TASK_STOP_RX_ST_S)
#define SOC_ETM_I2S1_TASK_STOP_RX_ST_V  0x00000001U
#define SOC_ETM_I2S1_TASK_STOP_RX_ST_S  20
/** SOC_ETM_I2S1_TASK_STOP_TX_ST : R/WTC/SS; bitpos: [21]; default: 0;
 *  Represents I2S1_task_stop_tx trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_I2S1_TASK_STOP_TX_ST    (BIT(21))
#define SOC_ETM_I2S1_TASK_STOP_TX_ST_M  (SOC_ETM_I2S1_TASK_STOP_TX_ST_V << SOC_ETM_I2S1_TASK_STOP_TX_ST_S)
#define SOC_ETM_I2S1_TASK_STOP_TX_ST_V  0x00000001U
#define SOC_ETM_I2S1_TASK_STOP_TX_ST_S  21
/** SOC_ETM_ULP_TASK_WAKEUP_CPU_ST : R/WTC/SS; bitpos: [22]; default: 0;
 *  Represents ULP_task_wakeup_cpu trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST    (BIT(22))
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_M  (SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_V << SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_S)
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_V  0x00000001U
#define SOC_ETM_ULP_TASK_WAKEUP_CPU_ST_S  22
/** SOC_ETM_ULP_TASK_INT_CPU_ST : R/WTC/SS; bitpos: [23]; default: 0;
 *  Represents ULP_task_int_cpu trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ULP_TASK_INT_CPU_ST    (BIT(23))
#define SOC_ETM_ULP_TASK_INT_CPU_ST_M  (SOC_ETM_ULP_TASK_INT_CPU_ST_V << SOC_ETM_ULP_TASK_INT_CPU_ST_S)
#define SOC_ETM_ULP_TASK_INT_CPU_ST_V  0x00000001U
#define SOC_ETM_ULP_TASK_INT_CPU_ST_S  23
/** SOC_ETM_RTC_TASK_START_ST : R/WTC/SS; bitpos: [24]; default: 0;
 *  Represents RTC_task_start trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_RTC_TASK_START_ST    (BIT(24))
#define SOC_ETM_RTC_TASK_START_ST_M  (SOC_ETM_RTC_TASK_START_ST_V << SOC_ETM_RTC_TASK_START_ST_S)
#define SOC_ETM_RTC_TASK_START_ST_V  0x00000001U
#define SOC_ETM_RTC_TASK_START_ST_S  24
/** SOC_ETM_RTC_TASK_STOP_ST : R/WTC/SS; bitpos: [25]; default: 0;
 *  Represents RTC_task_stop trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_RTC_TASK_STOP_ST    (BIT(25))
#define SOC_ETM_RTC_TASK_STOP_ST_M  (SOC_ETM_RTC_TASK_STOP_ST_V << SOC_ETM_RTC_TASK_STOP_ST_S)
#define SOC_ETM_RTC_TASK_STOP_ST_V  0x00000001U
#define SOC_ETM_RTC_TASK_STOP_ST_S  25
/** SOC_ETM_RTC_TASK_CLR_ST : R/WTC/SS; bitpos: [26]; default: 0;
 *  Represents RTC_task_clr trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_RTC_TASK_CLR_ST    (BIT(26))
#define SOC_ETM_RTC_TASK_CLR_ST_M  (SOC_ETM_RTC_TASK_CLR_ST_V << SOC_ETM_RTC_TASK_CLR_ST_S)
#define SOC_ETM_RTC_TASK_CLR_ST_V  0x00000001U
#define SOC_ETM_RTC_TASK_CLR_ST_S  26
/** SOC_ETM_RTC_TASK_TRIGGERFLW_ST : R/WTC/SS; bitpos: [27]; default: 0;
 *  Represents RTC_task_triggerflw trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST    (BIT(27))
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_M  (SOC_ETM_RTC_TASK_TRIGGERFLW_ST_V << SOC_ETM_RTC_TASK_TRIGGERFLW_ST_S)
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_V  0x00000001U
#define SOC_ETM_RTC_TASK_TRIGGERFLW_ST_S  27
/** SOC_ETM_GDMA_AHB_TASK_IN_START_CH0_ST : R/WTC/SS; bitpos: [28]; default: 0;
 *  Represents GDMA_AHB_task_in_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH0_ST    (BIT(28))
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH0_ST_M  (SOC_ETM_GDMA_AHB_TASK_IN_START_CH0_ST_V << SOC_ETM_GDMA_AHB_TASK_IN_START_CH0_ST_S)
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH0_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH0_ST_S  28
/** SOC_ETM_GDMA_AHB_TASK_IN_START_CH1_ST : R/WTC/SS; bitpos: [29]; default: 0;
 *  Represents GDMA_AHB_task_in_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH1_ST    (BIT(29))
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH1_ST_M  (SOC_ETM_GDMA_AHB_TASK_IN_START_CH1_ST_V << SOC_ETM_GDMA_AHB_TASK_IN_START_CH1_ST_S)
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH1_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH1_ST_S  29
/** SOC_ETM_GDMA_AHB_TASK_IN_START_CH2_ST : R/WTC/SS; bitpos: [30]; default: 0;
 *  Represents GDMA_AHB_task_in_start_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH2_ST    (BIT(30))
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH2_ST_M  (SOC_ETM_GDMA_AHB_TASK_IN_START_CH2_ST_V << SOC_ETM_GDMA_AHB_TASK_IN_START_CH2_ST_S)
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH2_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_TASK_IN_START_CH2_ST_S  30
/** SOC_ETM_GDMA_AHB_TASK_OUT_START_CH0_ST : R/WTC/SS; bitpos: [31]; default: 0;
 *  Represents GDMA_AHB_task_out_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_GDMA_AHB_TASK_OUT_START_CH0_ST    (BIT(31))
#define SOC_ETM_GDMA_AHB_TASK_OUT_START_CH0_ST_M  (SOC_ETM_GDMA_AHB_TASK_OUT_START_CH0_ST_V << SOC_ETM_GDMA_AHB_TASK_OUT_START_CH0_ST_S)
#define SOC_ETM_GDMA_AHB_TASK_OUT_START_CH0_ST_V  0x00000001U
#define SOC_ETM_GDMA_AHB_TASK_OUT_START_CH0_ST_S  31

